tutorials/H2_O2_N2_splitter/source_mapping/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
50271
(
0
0
0
0
0
5.55111512313e-16
5.55111512313e-16
0
...
)
;

boundaryField
{
    inletFuel
    {
        type            fixedValue;
        value           uniform 0;
    }
    inletAir
    {
        type            fixedValue;
        value           uniform 0.767;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            fixedValue;
        value           uniform 0.767;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
