tutorials/H2_O2_N2_splitter/source_mapping/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
50271
(
1.01177390659e-54
1.01428867867e-50
3.16972147907e-47
1.35818402809e-43
8.43790291538e-40
5.80892107186e-36
2.52410512466e-32
5.68667384246e-29
...
)
;

boundaryField
{
    inletFuel
    {
        type            fixedValue;
        value           uniform 0;
    }
    inletAir
    {
        type            fixedValue;
        value           uniform 0.233;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            fixedValue;
        value           uniform 0.233;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
