tutorials/H2_O2_N2_splitter/source_mapping/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
50271
(
350.000000093
350.000000319
350.000001294
350.000005293
350.000021758
350.000089589
350.000369093
350.001523986
...
)
;

boundaryField
{
    inletFuel
    {
        type            fixedValue;
        value           uniform 350;
    }
    inletAir
    {
        type            fixedValue;
        value           uniform 1500;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 350;
    }
    top
    {
        type            fixedValue;
        value           uniform 1500;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
