tutorials/H2_O2_N2_splitter/source_mapping/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
50271
(
(2132.99999933 -6.73567618949e-07 0)
(2132.99999741 -1.88933802419e-06 0)
(2132.9999897 -7.90817241021e-06 0)
(2132.99995791 -3.25131765316e-05 0)
(2132.99982702 -0.000133815423022 0)
(2132.99928761 -0.000551669364692 0)
(2132.99706366 -0.00227799468091 0)
(2132.98791196 -0.0093886393659 0)
...
)
;

boundaryField
{
    inletFuel
    {
        type            fixedValue;
        value           uniform (2133 0 0);
    }
    inletAir
    {
        type            fixedValue;
        value           uniform (1882 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (2133 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (1882 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
