tutorials/H2_O2_N2_splitter/source_mapping/0/magGradrho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      magGradrho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -4 0 0 0 0 0];

internalField   nonuniform List<scalar> 
50271
(
2.82649591809e-05
7.21295543949e-05
0.000235398689048
0.000763074374669
0.00248652983538
0.00809227881351
0.0262866978562
0.0849675926675
...
)
;

boundaryField
{
    inletFuel
    {
        type            calculated;
        value           nonuniform List<scalar> 
22
(
7.0107481122e-07
2.20675165013e-06
9.06334606439e-06
3.72500545425e-05
0.000153509240434
0.000632983655824
0.00261302454606
0.010800280305
...
)
;
    }
    inletAir
    {
        type            calculated;
        value           nonuniform List<scalar> 
28
(
6696.47564013
0.000132563250703
2.02197930514e-06
5.10038807594e-06
1.63006014844e-06
4.56571757752e-07
1.00946190941e-07
2.24284140547e-08
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
84
(
2142.78920833
0.583486768574
0.17156482448
0.0876327620284
0.0333114774207
0.00339825784151
0.0693959398031
0.186033511035
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
1036
(
2.8264052254e-05
0.000372059419546
0.00279524941081
0.0149418972962
0.0626006490124
0.217352691204
0.636865675198
1.56584438324
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
75
(
7.39891582701e-11
2.03026568114e-10
1.76991398684e-09
2.15579866312e-08
1.75618200214e-07
1.08887594436e-06
5.48871120079e-06
2.3439528479e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
