tutorials/H2_O2_N2_splitter/source_mapping/0/mixAlpha
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mixAlpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
50271
(
1.42013053863e-10
1.42013053921e-10
1.42013054168e-10
1.42013055182e-10
1.42013059359e-10
1.42013076565e-10
1.42013147463e-10
1.42013440411e-10
...
)
;

boundaryField
{
    inletFuel
    {
        type            calculated;
        value           uniform 1.4201305384e-10;
    }
    inletAir
    {
        type            calculated;
        value           uniform 7.87567866198e-10;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
84
(
1.59069946316e-10
1.41891448491e-10
1.4198514576e-10
1.42011979366e-10
1.42021569449e-10
1.42020102624e-10
1.42007639282e-10
1.41974161017e-10
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 1.4201305384e-10;
    }
    top
    {
        type            calculated;
        value           uniform 7.87567866198e-10;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
