tutorials/H2_O2_N2_splitter/source_mapping/0/mixMu
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mixMu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
50271
(
9.94763049068e-07
9.94763049489e-07
9.94763051302e-07
9.94763058737e-07
9.94763089358e-07
9.94763215504e-07
9.94763735297e-07
9.94765883047e-07
...
)
;

boundaryField
{
    inletFuel
    {
        type            calculated;
        value           uniform 9.94763048895e-07;
    }
    inletAir
    {
        type            calculated;
        value           uniform 5.59095064301e-06;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
84
(
1.11625554298e-06
9.93871296692e-07
9.94558429769e-07
9.94755171291e-07
9.94825480251e-07
9.94814726506e-07
9.94723316002e-07
9.94477371695e-07
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 9.94763048895e-07;
    }
    top
    {
        type            calculated;
        value           uniform 5.59095064301e-06;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
