tutorials/H2_O2_N2_splitter/source_mapping/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
50271
(
101325.000093
101325.00032
101325.001299
101325.005321
101325.021899
101325.090251
101325.372071
101326.537032
...
)
;

boundaryField
{
    inletFuel
    {
        type            fixedValue;
        value           uniform 101325;
    }
    inletAir
    {
        type            fixedValue;
        value           uniform 101325;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 101325;
    }
    top
    {
        type            fixedValue;
        value           uniform 101325;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
