tutorials/H2_O2_N2_splitter/source_mapping/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
50271
(
0.0701947322817
0.0701947323932
0.070194732876
0.0701947348602
0.070194743043
0.070194776791
0.0701949159705
0.0701954913939
...
)
;

boundaryField
{
    inletFuel
    {
        type            calculated;
        value           uniform 0.0701947322357;
    }
    inletAir
    {
        type            calculated;
        value           uniform 0.234396588436;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
84
(
0.117999867525
0.0704711057751
0.0703949016431
0.0703706642344
0.0703611992571
0.0703578494107
0.07036249542
0.0703845260253
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 0.0701947322357;
    }
    top
    {
        type            calculated;
        value           uniform 0.234396588436;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
