tutorials/H2_O2_N2_splitter/source_mapping/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inletFuel
    {
        type            patch;
        nFaces          13;
        startFace       3799;
    }
    inletAir
    {
        type            patch;
        nFaces          13;
        startFace       3812;
    }
    outlet
    {
        type            patch;
        nFaces          26;
        startFace       3825;
    }
    bottom
    {
        type            patch;
        nFaces          75;
        startFace       3851;
    }
    top
    {
        type            patch;
        nFaces          75;
        startFace       3926;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3900;
        startFace       4001;
    }
)

// ************************************************************************* //
