tutorials/H2_O2_N2_splitter/source_mapping/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM 8                                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}

type sets;

libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat raw;

fields
(
    U
    p
    T
    H2
    O2
    N2
);

sets
(
    centerline
    {
        type    uniform;
        axis    distance;

        start   (0      0.0025 0);
        end     (0.015  0.0025 0);

        nPoints 500;
    }

    vertical_x5mm
    {
        type    uniform;
        axis    y;

        start   (0.005 0     0);
        end     (0.005 0.005 0);

        nPoints 300;
    }
);
